---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterIterator.Dispose
source: html/b1b4d6bd-1955-eae3-2508-910aac639829.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator.Dispose Method

Releases all resources used by the ComponentRepeaterIterator

## Syntax (C#)
```csharp
public void Dispose()
```